пяоцяалла тяикифа
летабкгтес
  айеяаиес: и ,н,пк_еп
  пяацлатийес:POINTER
  ваяайтгяес: INPUT ,п[3,3],сулб
  коцийес: йеяд
аявг

 ! аявийопоигсг пимайа тяикифас ыс йемос
  циа и апо 1 левяи 3
    циа н апо 1 левяи 3
      п[и,н] <-- ' '
    текос_епамакгьгс
  текос_епамакгьгс

  POINTER <-- 1.1
  цяаье 'аявг паивмидиоу'
  ! ейтупысг пимайа емдеингс
  цяаье 'емдеинг деийтг:'
  аявг_епамакгьгс
    цяаье '| ^ |','|   |','|   |'
    циа и апо 2 левяи 3
      цяаье '|   |','|   |','|   |'
    текос_епамакгьгс
    !ейтупысг йамомийоу пимайа

    цяаье 'пимайас тяикифас:'
    циа и апо 1 левяи 3
      цяаье '|',п[и,1],'|','|',п[и,2],'|','|',п[и,3],'|'

    текос_епамакгьгс


    цяаье 'тяевоуса хесг'
    пк_еп <-- 0
    аявг_епамакгьгс
      аявг_епамакгьгс
        ам пк_еп>1 тоте
          цяаье 'ецйяимеис тгм йимгсг?(ам маи пата: [м] аккиыс еисацыцг ей меоу)'
        текос_ам
        диабасе INPUT
        пк_еп <-- пк_еп +1
      левяис_отоу   INPUT='а' г INPUT='д'   г INPUT='с'  г INPUT='Р' г INPUT='м'
      ам INPUT = 'д'   тоте
        ам POINTER>= 1.1 йаи POINTER <= 3.3 тоте
          POINTER <-- POINTER +0.1
        текос_ам
      аккиыс_ам  INPUT = 'а' тоте
        ам POINTER>= 1.1 йаи POINTER <= 1.3 тоте
          POINTER <-- POINTER -0.1
        текос_ам
      аккиыс_ам  INPUT = 'с' тоте
        ам POINTER>= 1.1 йаи POINTER <= 3.3 тоте
          POINTER <-- POINTER +1.0
        текос_ам
      аккиыс_ам  INPUT = 'Р' тоте
        ам POINTER>= 1.1 йаи POINTER <= 3.3 тоте
          POINTER <-- POINTER -1.0
        текос_ам
      текос_ам


    левяис_отоу   INPUT='м'

    цяаье 'сулбкоко:'
    диабасе сулб
    ам  POINTER= 1.1 тоте
      п[1,1] <-- сулб
    аккиыс_ам POINTER= 1.2 тоте
      п[1,2] <-- сулб
    аккиыс_ам POINTER= 1.3 тоте
      п[1,3] <-- сулб
    аккиыс_ам POINTER= 2.1 тоте
      п[2,1] <-- сулб
    аккиыс_ам POINTER= 2.2 тоте
      п[2,2] <-- сулб
    аккиыс_ам POINTER= 2.3 тоте
      п[2,3] <-- сулб
    аккиыс_ам POINTER= 3.1 тоте
      п[3,1] <-- сулб
    аккиыс_ам POINTER= 3.2 тоте
      п[3,2] <-- сулб
    аккиыс_ам POINTER= 3.3 тоте
      п[3,3] <-- сулб
    текос_ам


    йеяд <-- ьеудгс
    циа и апо 2 левяи 3
      циа н апо 2 левяи 3
        ам и=н тоте
          ам п[и,н]= п[и-1,н-1] тоте
            йеяд <-- акгхгс
          текос_ам
        текос_ам
      текос_епамакгьгс
    текос_епамакгьгс







  левяис_отоу  INPUT= 'е' г йеяд= акгхгс


текос_пяоцяаллатос
